import 'overlay_lang_const.dart';

class OverlayTaIn {
  static Map<String, String> get translations => {
        OverlayLangConst.msgNewOrderRequest: 'புதிய ஆர்டர் கோரிக்கை',
        OverlayLangConst.msgSendingYourRequest: 'உங்கள் கோரிக்கை அனுப்பப்படுகிறது',
        OverlayLangConst.msgPleaseWaitWhileWeProcessYourRequest: 'உங்கள் கோரிக்கையைச் செயல்படுத்தும் வரை தயவுசெய்து காத்திருக்கவும்',

        // cancelled order details
        OverlayLangConst.lblCancelledOrder: 'ரத்து செய்யப்பட்ட ஆர்டர்:',
        OverlayLangConst.msgOrderCancelled: 'ஆர்டர் ரத்து செய்யப்பட்டது',
        OverlayLangConst.msgOrderHasBeenCancelled: 'ஆர்டர் ரத்து செய்யப்பட்டுள்ளது',
        OverlayLangConst.msgStayAvailableForNewOrders: 'புதிய ஆர்டர்களுக்குத் தயாராக இருங்கள்.',

        // order push overlay
        OverlayLangConst.lblTaskAccepted: 'பணி ஏற்கப்பட்டது',
        OverlayLangConst.msgBoomYouAcceptedTheTaskLikeAProLetsHitTheRoad: 'அருமை! ஒரு ப்ரோ போல இந்த வேலையை ஏற்றுக்கொண்டீர்கள் 💪 கிளம்புவோம் வாருங்கள்.',
        OverlayLangConst.lblOopsSomethingWentWrong: 'அச்சச்சோ! ஏதோ தவறு நடந்துவிட்டது',

        // close overlay
        OverlayLangConst.lblCloseOverlay: 'ஓவர்லேவை மூடவும்',
        OverlayLangConst.msgCloseOverlayConfirmation: 'இதை மூடினால், நீங்கள் ஆஃப்லைனாகக் கருதப்படுவீர்கள். உங்களுக்குப் புதிய ஆர்டர்கள் வராது.',
        OverlayLangConst.msgMarkingYouOffline: 'உங்களை ஆஃப்லைனுக்கு மாற்றுகிறது...',

        /// quick mode transition overlay
        OverlayLangConst.headSwitchingToQuickMode: 'மாறுகிறது: குயிக் மோடு',
        OverlayLangConst.headSwitchingToNormalMode: 'நார்மல் மோடுக்கு மாறுகிறது',
        OverlayLangConst.msgSwitchingToQuickMode: 'குயிக் காமர்ஸ் ஆர்டர்களுக்கு, தயவுசெய்து வரிசைப்படி ஆர்டர்களை முடிக்கவும்',
        OverlayLangConst.msgSwitchingToNormalMode: 'சிறந்த வேலை! உங்கள் அனைத்து குயிக் காமர்ஸ் ஆர்டர்களையும் முடித்துவிட்டீர்கள்',
        OverlayLangConst.btnLetsGo: 'கிளம்புவோம் ⚡',
      };
}