import 'referral_lang_constants.dart';

class ReferralTaIn {
  static Map<String, String> get translations => {
        ReferralLangConstants.headReferAndEarn: 'பரிந்துரைத்து சம்பாதிக்கவும்',
        ReferralLangConstants.lblTotalEarnings: 'மொத்த பரிந்துரை வருவாய்',
        ReferralLangConstants.lblReferYourFriends:
            'எளிமையான ஸ்டெப்ஸ்களில் உங்கள் \nநண்பர்களை பரிந்துரைக்கவும்',
        ReferralLangConstants.btnReferAndEarnNow:
            'இப்போதே பரிந்துரைத்து சம்பாதிக்கவும்! 💸',
        ReferralLangConstants.lblYourReferrals: 'உங்கள் பரிந்துரைகள்',
        ReferralLangConstants.headReferralDetails: 'பரிந்துரை விவரங்கள்',
        ReferralLangConstants.btnRemindFriends: 'நண்பருக்கு நினைவூட்டு',
        ReferralLangConstants.msgHelpFriends:
            'உங்கள் நண்பர் மைல்கற்களை முடிக்க உதவி செய்து சம்பாதிக்கவும் ',
        ReferralLangConstants.lblCampaignExpired: 'கேம்பெய்ன் முடிவடைந்தது',
        ReferralLangConstants.headAvailableOffers: 'கிடைக்கும் ஆஃபர்கள்',
        ReferralLangConstants.lblSelectHighEarningReferral:
            'அதிக வருவாய் தரும் பரிந்துரையைத் தேர்ந்தெடுத்து நண்பர்களுடன் பகிரவும்',
        ReferralLangConstants.lblSearchPincodeHub:
            'ஹப் பெயர் அல்லது பின்கோடு மூலம் தேடவும்',
        ReferralLangConstants.lblOfferValidHubList: 'ஆஃபர் உள்ள ஹப் பட்டியல்',
        ReferralLangConstants.btnShare: 'பகிரவும்',
        ReferralLangConstants.lblEarnUpto: 'வரை சம்பாதிக்கவும்',
        ReferralLangConstants.lblExpiryDate: 'முடிவு தேதி : ',
        ReferralLangConstants.msgSelectReferralCampaign:
            'நண்பர்களுடன் பகிர விரும்பும் பரிந்துரை ஆஃபரைத் தேர்ந்தெடுக்கவும்',
        ReferralLangConstants.msgShareWithFriends:
            'உங்கள் பரிந்துரை லிங்கை அனுப்பி உங்கள் நண்பர் Kaptaan-ஆக சேர உதவவும்',
        ReferralLangConstants.lblEnjoyBonus: 'பரிந்துரை போனஸை அனுபவிக்கவும்',
        ReferralLangConstants.msgEnjoyBonus:
            'உங்கள் நண்பர் தேவையான ஆர்டர்களை முடித்தவுடன் உங்கள் போனஸ் கிடைக்கும்',
        ReferralLangConstants.lblSelectReferralCampaign:
            'பரிந்துரை கேம்பெய்னைத் தேர்ந்தெடுக்கவும்',
        ReferralLangConstants.lblShareWithFriends: 'உங்கள் நண்பருடன் பகிரவும்',
        ReferralLangConstants.lblOfferValidHub: 'ஆஃபர் செல்லுபடியாகும் ஹப்',
        ReferralLangConstants.lblJoiningBonus: 'ஜாயினிங் போனஸ்',
        ReferralLangConstants.lblMilestonesUpdated:
            'மைல்கற்கள் தினமும் நள்ளிரவில் புதுப்பிக்கப்படும் ',
        ReferralLangConstants.lblNoHubsAvailable: 'ஹப்கள் எதுவும் இல்லை',
        ReferralLangConstants.msgMoreOnThis:
            ' இந்தப் பரிந்துரையில் கூடுதல் வருமானம்!',
        ReferralLangConstants.lblReferMoreFriends:
            'கூடுதல் நண்பர்களை பரிந்துரைத்து சம்பாதிக்கவும் ',
        ReferralLangConstants.lblPerReferral: ' ஒரு பரிந்துரைக்கு',
        ReferralLangConstants.lblNoCampaignsAvailable:
            'கேம்பெய்ன்கள் எதுவும் இல்லை',
        ReferralLangConstants.lblLateNote:
            'ஓ! உங்கள் நண்பர் சிறிது தாமதமாகச் சேர்ந்துள்ளார் எனத் தெரிகிறது, கவலைப்பட வேண்டாம் இந்தப் பரிந்துரைக்கு இன்னும் உங்களுக்கு வருமானம் கிடைக்கும்',
        ReferralLangConstants.msgReferralNotEligible:
            'பரிந்துரைக்கு தகுதியில்லை — உங்கள் நண்பர் குறிப்பிட்ட ஹப் அல்லது Blitz-உடன் செயல்பாட்டில் இல்லை',
        ReferralLangConstants.lblNoGoalsAvailable:
            'இலக்குகள் எதுவும் இல்லை',
        ReferralLangConstants.lblWrongNodeNote:
            'உங்கள் நண்பர் வேறு ஹப்பில் சேர்ந்துள்ளார், இருந்தாலும் நீங்கள் அடிப்படை வெகுமதிக்குத் தகுதியானவர்.',
        ReferralLangConstants.btnViewReferral:
            'பரிந்துரை கேம்பெய்ன்களைப் பார்க்கவும் 💸',
        ReferralLangConstants.msgTrackReferralEarnings:
            'உங்கள் பரிந்துரை வருவாயை இங்கே டிராக் செய்யலாம்',
        ReferralLangConstants.btnWatchHowItWorks: 'எப்படி என்று பாருங்கள்',
        ReferralLangConstants.lblSelectCampaign: 'கேம்பெய்னைத்\nதேர்ந்தெடு',
        ReferralLangConstants.lblReferYourFriend: 'நண்பரைப்\nபரிந்துரைக்கவும்',
        ReferralLangConstants.lblTrackYourBonus: 'போனஸைத்\nடிராக் செய்யவும்',
        ReferralLangConstants.lblOfferDetails: 'ஆஃபர் விவரங்கள்',
        ReferralLangConstants.lblHubList: 'ஹப் பட்டியல்',
        ReferralLangConstants.lblMilestones: 'மைல்கற்கள்',
      };
}
