import 'package:localisation_review/features/kyc_onboarding/kyc_lang_constants.dart';

class KycKnIn {
  static Map<String, String> get translations => {
        KycLangConstants.headHighEarnings: 'ಅದ್ಭುತ ಗಳಿಕೆ',
        KycLangConstants.msgHighEarnings:
            'ನಿಮ್ಮ ಶ್ರಮ ಫಲ ನೀಡುತ್ತದೆ!\nಆಕರ್ಷಕ ಬಹುಮಾನಗಳೊಂದಿಗೆ ಅನಿಯಮಿತ ಗಳಿಕೆಯ ಅವಕಾಶ ಪಡೆಯಿರಿ.',
        KycLangConstants.headOntimePayment: 'ಸಮಯಕ್ಕೆ ಸರಿಯಾಗಿ ಪಾವತಿ',
        KycLangConstants.msgOntimePayment:
            'ನಮ್ಮನ್ನು ನಂಬಿ!\nನಿಮ್ಮ ಗಳಿಕೆಯನ್ನು ಯಾವುದೇ ವಿಳಂಬವಿಲ್ಲದೆ, ಸಮಯಕ್ಕೆ ಸರಿಯಾಗಿ ಪಡೆಯಿರಿ.',
        KycLangConstants.headBirthdayLeave: 'ಜನ್ಮದಿನದಂದು ವೇತನ ಸಹಿತ ರಜೆ',
        KycLangConstants.msgBirthdayLeave:
            'ನಿಮ್ಮ ಜನ್ಮದಿನದ ಆಚರಣೆ ನಮ್ಮ ಕಡೆಯಿಂದ!\nಯಾವುದೇ ಚಿಂತೆಯಿಲ್ಲದೆ ನಿಮ್ಮ ವಿಶೇಷ ದಿನವನ್ನು ಆಚರಿಸಿ.',
        KycLangConstants.headWorkHours: 'ನಿಮ್ಮ ಆಯ್ಕೆಯ\nಕೆಲಸದ ಸಮಯ',
        KycLangConstants.msgWorkHours:
            'ನಿಮ್ಮದೇ ವೇಗದಲ್ಲಿ ಕೆಲಸ ಮಾಡಿ!\nನಿಮ್ಮ ವೇಳಾಪಟ್ಟಿಯನ್ನು ಆಯ್ಕೆ ಮಾಡುವ ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಆನಂದಿಸಿ.',
        KycLangConstants.headDeliverExperience:
            'ಒಟ್ಟಾಗಿ ಉತ್ತಮ ಅನುಭವವನ್ನು ನೀಡೋಣ!',
        KycLangConstants.msgGetStarted:
            '5000+ ಅದ್ಭುತ ಗಳಿಕೆ ಮಾಡುವ Kaptaans ಇರುವ ನಮ್ಮ ಬೆಳೆಯುತ್ತಿರುವ ಸಮುದಾಯದ ಭಾಗವಾಗಿ!',
        KycLangConstants.lblVerifyAccount: 'ಬ್ಯಾಂಕ್ ಖಾತೆಯನ್ನು ಪರಿಶೀಲಿಸಿ',
        KycLangConstants.msgVerifyAccount:
            'ಸಮಯಕ್ಕೆ ಸರಿಯಾದ ಪಾವತಿಗಾಗಿ ದಯವಿಟ್ಟು ನಿಮ್ಮ ಬ್ಯಾಂಕ್ ಖಾತೆಯ ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಿ',
        KycLangConstants.msgBankAccountVerified:
            'ನಿಮ್ಮ ಬ್ಯಾಂಕ್ ಖಾತೆಯ ವಿವರಗಳನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಪರಿಶೀಲಿಸಲಾಗಿದೆ',
        KycLangConstants.lblCompleteYourKycWarning:
            'ಗಳಿಕೆಯನ್ನು ಮುಂದುವರಿಸಲು ದಯವಿಟ್ಟು ನಿಮ್ಮ KYC ಪರಿಶೀಲನೆಯನ್ನು ಶೀಘ್ರದಲ್ಲೇ ಪೂರ್ಣಗೊಳಿಸಿ!',
        KycLangConstants.btnStartKyc: 'KYC ಪ್ರಾರಂಭಿಸಿ',
        KycLangConstants.lblCompleteYourKyc: 'ನಿಮ್ಮ KYC ಪೂರ್ಣಗೊಳಿಸಿ',
        KycLangConstants.lblDocsRequired: 'ಅಗತ್ಯ ದಾಖಲೆಗಳು',
        KycLangConstants.headSeamlessApp: 'ಸುಲಭವಾದ ಆ್ಯಪ್',
        KycLangConstants.headFlexibleHours: 'ನಿಮ್ಮಿಷ್ಟದ ಸಮಯ',
        KycLangConstants.headHighIncentives: 'ಅದ್ಭುತ ಪ್ರೋತ್ಸಾಹಧನ',
        KycLangConstants.headOntimeSupport: 'ಸಮಯಕ್ಕೆ ಸರಿಯಾದ ಸಪೋರ್ಟ್',
        KycLangConstants.lblCompleteJob: 'ಕೆಲಸ ಪೂರ್ಣಗೊಳಿಸಿ',

        // Under review page
        KycLangConstants.headUnderReview: 'KYC ಪರಿಶೀಲನೆಯಲ್ಲಿದೆ ⌛',
        KycLangConstants.headUnderReviewHello:
            'ಹಲೋ {name}, KYC ಪರಿಶೀಲನೆಯಲ್ಲಿದೆ ⌛',
        KycLangConstants.msgUnderReview:
            'ಆಪ್ಕೀ KYC ಕೀ ಜಾಂಚ್ ಅಭೀ ಚಲ್ ರಹೀ ಹೈ. ಕೃಪಯಾ ಇಂತಜಾರ್ ಕರೇಂ, ಪ್ರೊಸೆಸ್ ಪೂರೀ ಹೋತೇ ಹೀ ಆಪ್ಕೋ ಸೂಚೀತ್ ಕರ್ ದಿಯಾ ಜಾಯೇಗಾ.',
        KycLangConstants.lblUnderReviewThanks:
            'ನಿಮ್ಮ ತಾಳ್ಮೆಗೆ ಧನ್ಯವಾದಗಳು. ನೀವು Blitz ನೊಂದಿಗೆ ಏಕೆ ಕೆಲಸ ಮಾಡಬೇಕು?',

        // Completed status page
        KycLangConstants.lblApprovedKyc: 'ನಿಮ್ಮ ಅರ್ಜಿಯನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ.',
        KycLangConstants.msgApprovedKyc:
            'ನಿಮ್ಮ ಅರ್ಜಿಯನ್ನು ಎಲ್ಲಾ Blitz ಗೋದಾಮುಗಳಿಗೆ ಯಶಸ್ವಿಯಾಗಿ ಕಳುಹಿಸಲಾಗಿದೆ.',
        KycLangConstants.lblUnderReview: 'ಪರಿಶೀಲನೆಯಲ್ಲಿದೆ',
        KycLangConstants.msgKycUnderReview:
            'ನಿಮ್ಮ KYC ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ ಮತ್ತು ಇದು ಪೂರ್ಣಗೊಳ್ಳಲು 24 ಗಂಟೆಗಳವರೆಗೆ ತೆಗೆದುಕೊಳ್ಳಬಹುದು.',
        KycLangConstants.lblKycDetailsReviewed: 'KYC ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಲಾಗಿದೆ',
        KycLangConstants.msgKycDetailsBeingReviewed:
            'ನಿಮ್ಮ KYC ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ. ದಯವಿಟ್ಟು ಕೆಲವು ನಿಮಿಷ ಕಾಯಿರಿ.',
        KycLangConstants.lblRefreshNow: 'ಈಗಲೇ ರಿಫ್ರೆಶ್ ಮಾಡಿ',
        KycLangConstants.lblRefreshInSeconds:
            '{seconds} ಸೆಕೆಂಡುಗಳಲ್ಲಿ ರಿಫ್ರೆಶ್ ಮಾಡಿ',

        // Kickstart flow
        KycLangConstants.lblCompleteInDays: 'ಬ್ಯಾಂಕ್ ವಿವರಗಳನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ ',
        KycLangConstants.lblAlertHeadlineKyc:
            'ಸಮಯ ಮಿತಿಯೊಳಗೆ KYC ಪೂರ್ಣಗೊಳಿಸದಿದ್ದರೆ, ಖಾತೆಯನ್ನು ಲಾಕ್ ಮಾಡಲಾಗುತ್ತದೆ.',
        KycLangConstants.lblAlertHeadlineBank:
            'ಸಮಯ ಮಿತಿಯೊಳಗೆ ಬ್ಯಾಂಕ್ ವಿವರಗಳನ್ನು ಸಲ್ಲಿಸದಿದ್ದರೆ, ಖಾತೆಯನ್ನು ಲಾಕ್ ಮಾಡಲಾಗುತ್ತದೆ.',
        KycLangConstants.lblCompleteKyc:
            'ಗಳಿಕೆಯನ್ನು ಮುಂದುವರಿಸಲು, ದಯವಿಟ್ಟು ನಿಮ್ಮ KYC ಪರಿಶೀಲನೆಯನ್ನು ಶೀಘ್ರದಲ್ಲೇ ಪೂರ್ಣಗೊಳಿಸಿ!',
        KycLangConstants.msgErrorWrongKyc:
            'ಅಪ್ಲಿಕೇಶನ್‌ನಲ್ಲಿ ಕೆಲವು ದೋಷ ಸಂಭವಿಸಿದೆ.',
        KycLangConstants.msgDeadlineErrorKyc:
            'KYC ಯ ಗಡುವು ಲಭ್ಯವಿಲ್ಲ. ಉಳಿದ ದಿನಗಳನ್ನು ಲೆಕ್ಕ ಹಾಕಲು ಸಾಧ್ಯವಿಲ್ಲ.',
        KycLangConstants.lblKycRejected: 'ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ತಿರಸ್ಕೃತಗೊಂಡಿದೆ',
        KycLangConstants.msgKycRejected:
            'ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ KYC ಮಾರ್ಗಸೂಚಿಗಳನ್ನು ಪಾಲಿಸದ ಕಾರಣ ತಿರಸ್ಕರಿಸಲಾಗಿದೆ',
        KycLangConstants.lblKycBlacklisted: 'ಆಪ್ ಬ್ಲ್ಯಾಕ್ಲಿಸ್ಟೆಡ್ ಹೈ',
        KycLangConstants.msgKycBlacklisted:
            'ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಅನ್ನು ಬ್ಲ್ಯಾಕ್‌ಲಿಸ್ಟ್ ಮಾಡಲಾಗಿದೆ, ದಯವಿಟ್ಟು ನಿಮ್ಮ ಟೀಮ್ ಲೀಡ್ ಅವರನ್ನು ಸಂಪರ್ಕಿಸಿ',
        KycLangConstants.lblKycCompleted: 'KYC ಪೂರ್ಣಗೊಂಡಿದೆ',
        KycLangConstants.msgKycCompleted:
            'ನಿಮ್ಮ ಪ್ರೊಫೈಲ್‌ನ KYC ವಿವರಗಳನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಪರಿಶೀಲಿಸಲಾಗಿದೆ',
        KycLangConstants.msgUnableToRefreshKycStatus:
            'KYC ಸ್ಥಿತಿಯನ್ನು ರಿಫ್ರೆಶ್ ಮಾಡಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ.',
        KycLangConstants.msgYoureAlmostDoneCollectOnboardingKitFromHub:
            "ನಿಮ್ಮ ಕೆಲಸ ಬಹುತೇಕ ಮುಗಿದಿದೆ—ಈಗ ಹಬ್‌ನಿಂದ ನಿಮ್ಮ ಆನ್‌ಬೋರ್ಡಿಂಗ್ ಕಿಟ್ ತೆಗೆದುಕೊಳ್ಳಿ.",
        KycLangConstants.headWorkDetailsCompleted: "ಕೆಲಸದ ವಿವರಗಳು ಪೂರ್ಣಗೊಂಡಿವೆ",

        KycLangConstants.lblSelectAndNext: "ಆಯ್ಕೆಮಾಡಿ ಮತ್ತು ಮುಂದುವರಿಯಿರಿ",
        KycLangConstants.lblSearchPincode: "ಪಿನ್‌ಕೋಡ್ ಹುಡುಕಿ",

        // Select vehicle page
        KycLangConstants.lblSelectModeOfVehicle: "ವಾಹನದ ಪ್ರಕಾರವನ್ನು ಆಯ್ಕೆಮಾಡಿ",
        KycLangConstants.msgDrivingLicenseRequired:
            "ಪೆಟ್ರೋಲ್ ವಾಹನಗಳಿಗೆ ಡ್ರೈವಿಂಗ್ ಲೈಸೆನ್ಸ್ ಅಗತ್ಯವಿದೆ.",
        KycLangConstants.lblPetrolMotorcycle: "ಪೆಟ್ರೋಲ್ ಮೋಟರ್‌ಸೈಕಲ್",
        KycLangConstants.lblEvVehicle: "EV ವಾಹನ",
        KycLangConstants.lblThreeWheeler: "ಮೂರು ಚಕ್ರದ ವಾಹನ",
        KycLangConstants.lblFourWheeler: "ನಾಲ್ಕು ಚಕ್ರದ ವಾಹನ",
        KycLangConstants.lblFuelBonus: 'ಇಂಧನ ಬೋನಸ್',
        KycLangConstants.lblNoFuelAmount: 'ಯಾವುದೇ ಇಂಧನ ಮೊತ್ತವಿಲ್ಲ',

        // Start KYC screen
        KycLangConstants.msgYourProfileIsAllSetCompleteKycStartEarning:
            "ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಸಿದ್ಧವಾಗಿದೆ!\nದಯವಿಟ್ಟು ನಿಮ್ಮ KYC ಪೂರ್ಣಗೊಳಿಸಿ ಮತ್ತು ಗಳಿಕೆಯನ್ನು ಪ್ರಾರಂಭಿಸಿ.",
        KycLangConstants.msgKeepTheFollowingDocumentsReadyForKyc:
            "KYC ಗಾಗಿ ಈ ಕೆಳಗಿನ ದಾಖಲೆಗಳನ್ನು ಸಿದ್ಧವಾಗಿ ಇರಿಸಿ.",
        KycLangConstants.lblCompleteKycStartEarning:
            "KYC ಪೂರ್ಣಗೊಳಿಸಿ ಮತ್ತು ಗಳಿಕೆ ಆರಂಭಿಸಿ",
        KycLangConstants.lblDl: "ಡ್ರೈವಿಂಗ್ ಲೈಸೆನ್ಸ್",
        KycLangConstants.lblPan: "ಪ್ಯಾನ್ ಕಾರ್ಡ್",
        KycLangConstants.lblAadhaar: "ಆಧಾರ್",

        // Submit bank details page
        KycLangConstants.lblSubmitBankDetailsToResumeJob:
            "ಕೆಲಸವನ್ನು ಪುನರಾರಂಭಿಸಲು ಬ್ಯಾಂಕ್ ವಿವರಗಳನ್ನು ಸಲ್ಲಿಸಿ.",
        KycLangConstants.msgPleaseCompleteAllYourDetailsSoonToContinueEarning:
            "ಗಳಿಕೆಯನ್ನು ಮುಂದುವರಿಸಲು, ದಯವಿಟ್ಟು ನಿಮ್ಮ ಎಲ್ಲಾ ವಿವರಗಳನ್ನು ಶೀಘ್ರದಲ್ಲೇ ಪೂರ್ಣಗೊಳಿಸಿ!",

        // Visit hub page
        KycLangConstants.btnShowQr: "QR ತೋರಿಸಿ",
        KycLangConstants.btnCallHub: "ಹಬ್‌ಗೆ ಕರೆ ಮಾಡಿ",
        KycLangConstants.lblReachHubAndEarn:
            "ಇಂದೇ ಹಬ್ ತಲುಪಿ ಮತ್ತು ಗಳಿಕೆ ಆರಂಭಿಸಿ.",
        KycLangConstants.btnShowHubDirection: "ಹಬ್ ಮಾರ್ಗವನ್ನು ತೋರಿಸಿ",
        KycLangConstants.lblWhatOurPartnersSay: "ನಮ್ಮ Kaptaans ಏನು ಹೇಳ್ತಾರೆ ❤️",
        KycLangConstants.lblJoiningFeeDetails: "ಸೇರ್ಪಡೆ ಶುಲ್ಕದ ವಿವರಗಳು",
        KycLangConstants.msgJoiningFeeWillBeDeductedFromYourFirstPayout:
            "ಸೇರ್ಪಡೆ ಶುಲ್ಕವನ್ನು ನಿಮ್ಮ ಮೊದಲ ಪಾವತಿಯಿಂದ \nಕಡಿತಗೊಳಿಸಲಾಗುತ್ತದೆ.",

        // rider review
        KycLangConstants.headReview1:
            "ನಾನು Blitz UPI ನಲ್ಲಿ ಅವಕಾಶ ಕಂಡೆ ಮತ್ತು ಅದನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಅಳವಡಿಸಿಕೊಂಡೆ. ಇದು ವೇಗ ಮತ್ತು ಸುಲಭ, ಮತ್ತು ಇದರ ಪ್ರೋತ್ಸಾಹಧನವು ನನ್ನ ಗಳಿಕೆಯಲ್ಲಿ ಬಹಳ ವ್ಯತ್ಯಾಸ ಮಾಡಿದೆ!",
        KycLangConstants.headReview2:
            "ಮೈಲ್‌ಸ್ಟೋನ್‌ಗಳು ನನಗೆ ಪ್ರತಿದಿನ ಹೆಚ್ಚು ಕಷ್ಟಪಟ್ಟು ಕೆಲಸ ಮಾಡಲು ಪ್ರೇರಣೆ ನೀಡುತ್ತವೆ. ನಾನು ಪೂರ್ಣಗೊಳಿಸುವ ಮೈಲ್‌ಸ್ಟೋನ್‌ಗಳು, ಶ್ರಮಕ್ಕೆ ಖಂಡಿತವಾಗಿಯೂ ಫಲವಿದೆ ಎಂದು ತೋರಿಸುತ್ತವೆ.",
        KycLangConstants.headReview3:
            "ಪ್ರತಿ ವಿತರಣೆಯು ನನ್ನ ಗುರಿಗಳತ್ತ ಇನ್ನಷ್ಟು ಹತ್ತಿರ ಕರೆದೊಯ್ಯುತ್ತದೆ.",
        KycLangConstants.headReview4:
            "Blitz ನನಗೆ ಪ್ರತಿದಿನ ಮುಂದುವರೆಯಲು ಪ್ರೇರಣೆ ನೀಡುತ್ತದೆ.",
        KycLangConstants.headReview5:
            "Blitz ಕುಟುಂಬದ ಭಾಗವಾಗಿರುವುದಕ್ಕೆ ನನಗೆ ಹೆಮ್ಮೆ ಇದೆ ಮತ್ತು ನನ್ನ ಶ್ರಮಕ್ಕೆ ಇಲ್ಲಿ ಮಾನ್ಯತೆ ಸಿಗುತ್ತಿರುವುದನ್ನು ನೋಡಿ ಸಂತೋಷವಾಗಿದೆ.",
        KycLangConstants.lblChandranNadarMumbaiHub:
            "— ಚಂದ್ರನ್ ನಾಡರ್, ಮುಂಬೈ ಹಬ್",
        KycLangConstants.lblManishRaiDelhiHub: "— ಮನೀಶ್ ರಾಯ್, ದೆಹಲಿ ಹಬ್",
        KycLangConstants.lblKrishnaGuptaMumbaiHub: "— ಕೃಷ್ಣ ಗುಪ್ತಾ, ಮುಂಬೈ ಹಬ್",
        KycLangConstants.lblSharadPuneHub: "— ಶರದ್, ಪುಣೆ ಹಬ್",
        KycLangConstants.lblShivnathHyderabadHub: "— ಶಿವನಾಥ್, ಹೈದರಾಬಾದ್ ಹಬ್",

        // Offer
        KycLangConstants.headEarnUpto10000In1stMonth:
            "ಮೊದಲ ತಿಂಗಳಲ್ಲಿ ₹10,000 ವರೆಗೆ ಗಳಿಸಿ",
        KycLangConstants.lblThroughJoiningBonusAndIncentives:
            "ಸೇರ್ಪಡೆ ಬೋನಸ್ ಮತ್ತು ಪ್ರೋತ್ಸಾಹಧನಗಳ ಮೂಲಕ",
        KycLangConstants.headEarnUpto2500WithoutDelivering:
            "ವಿತರಣೆ ಮಾಡದೆಯೇ ₹2,500 ವರೆಗೆ ಗಳಿಸಿ",
        KycLangConstants.lblByReferringAFriendToJoinBlitz:
            "ಸ್ನೇಹಿತರನ್ನು Blitz ಸೇರಲು ಉಲ್ಲೇಖಿಸುವುದರ ಮೂಲಕ",

        // Work type page
        KycLangConstants.msgPleaseSelectHubWhereYouWantToWorkInNextScreen:
            "ದಯವಿಟ್ಟು ಮುಂದಿನ ಸ್ಕ್ರೀನ್‌ನಲ್ಲಿ ನೀವು ಕೆಲಸ ಮಾಡಲು ಬಯಸುವ ಹಬ್ ಅನ್ನು ಆಯ್ಕೆಮಾಡಿ.",
        KycLangConstants.headSelectHubInNextScreen:
            "ಮುಂದಿನ ಸ್ಕ್ರೀನ್‌ನಲ್ಲಿ ಹಬ್ ಆಯ್ಕೆಮಾಡಿ",
        KycLangConstants.lblWorkType: "ಕೆಲಸದ ಪ್ರಕಾರ ಆಯ್ಕೆಮಾಡಿ",
        KycLangConstants.lblEarnUpto: "ಪಡೆಯಿರಿ",
        KycLangConstants.lblSimilarTo: "ಇದೇ ರೀತಿ",
        KycLangConstants.lblSelectCity: 'ನಗರ ಆರಿಸಿ',

        // carousel
        KycLangConstants.headCollectOnboardingKit:
            "ಆನ್‌ಬೋರ್ಡಿಂಗ್ ಕಿಟ್ ಪಡೆಯಿರಿ,",
        KycLangConstants.headReferAndEarnThe: "ಉಲ್ಲೇಖಿಸಿ ಮತ್ತು ಗಳಿಸಿ",
        KycLangConstants.headCompleteMilestone: "ಮೈಲ್‌ಸ್ಟೋನ್ ಪೂರ್ಣಗೊಳಿಸಿ",
        KycLangConstants.lblStartWorking: "ಕೆಲಸ ಪ್ರಾರಂಭಿಸಿ",
        KycLangConstants.lblHighestBonus: "ಅತ್ಯಧಿಕ ಬೋನಸ್",
        KycLangConstants.lblEarnExtraEveryDay: "ಪ್ರತಿದಿನ ಹೆಚ್ಚುವರಿ ಗಳಿಸಿ",
        KycLangConstants.lblHighBonus: "ಹೆಚ್ಚಿನ ಬೋನಸ್ 🔥",
        KycLangConstants.lblOtherHubs: "ಇತರ ಹಬ್‌ಗಳು",
        KycLangConstants.lblFriendsHub: "ಸ್ನೇಹಿತರ ರೆಫರಲ್ ಹಬ್",

        // Visit hub page
        KycLangConstants.msgNodeVerificationFailed: "ನೋಡ್ ಪರಿಶೀಲನೆ ವಿಫಲವಾಗಿದೆ",
        KycLangConstants.msgPleaseCompleteNodeVerificationFromFranchiseOwnerApp:
            "ದಯವಿಟ್ಟು Franchise owner ಆ್ಯಪ್‌ನಿಂದ ನೋಡ್ ಪರಿಶೀಲನೆಯನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ.",
        KycLangConstants.lblQrVerified: "QR ಪರಿಶೀಲಿಸಲಾಗಿದೆ",
        KycLangConstants.lblHowDidYouFirstHearAboutBlitz:
            "Blitz ಬಗ್ಗೆ ನಿಮಗೆ ಮೊದಲು ಹೇಗೆ ತಿಳಿಯಿತು?",

        // Geo fence bottomsheet
        KycLangConstants.lblShowQrManager:
            "ಈ QR ಕೋಡ್ ಅನ್ನು ಹಬ್ ಮ್ಯಾನೇಜರ್‌ಗೆ ತೋರಿಸಿ.",
        KycLangConstants.msgQrCodeManager:
            "ಆನ್‌ಬೋರ್ಡಿಂಗ್ ಪೂರ್ಣಗೊಳಿಸಲು, ದಯವಿಟ್ಟು ಈ QR ಕೋಡ್ ಅನ್ನು ಸ್ಕ್ಯಾನ್ ಮಾಡಿಸಲು ಟೀಮ್ ಲೀಡರ್‌ಗೆ ತೋರಿಸಿ.",

        // Rider to node map
        KycLangConstants.lblWaitingForDestination:
            "ಗಮ್ಯಸ್ಥಾನಕ್ಕಾಗಿ ಕಾಯಲಾಗುತ್ತಿದೆ...",

        // Pincode badges
        KycLangConstants.lblServiceablePincodesDataNotAvailable:
            "ಸೇವೆಗೆ ಲಭ್ಯವಿರುವ ಪಿನ್‌ಕೋಡ್‌ಗಳ ಡೇಟಾ ಲಭ್ಯವಿಲ್ಲ",

        // Work type
        KycLangConstants.lblFastLocalOrders: "ಫಾಸ್ಟ್ ಲೋಕಲ್ ಆರ್ಡರ್ಸ್ ⚡",
        KycLangConstants.lblBulkOrders: "ಬಲ್ಕ್ ಆರ್ಡರ್ಸ್ 📦",
        KycLangConstants.lblQuickCommerce: "ಕ್ವಿಕ್ ಕಾಮರ್ಸ್",
        KycLangConstants.lblECommerce: "ಇ-ಕಾಮರ್ಸ್",

        // Pincode badges
        KycLangConstants.lblServiceablePincodes: "ಸೇವೆಗೆ ಲಭ್ಯ ಪಿನ್‌ಕೋಡ್‌ಗಳು",
        KycLangConstants.lblAboutReferralSource: "ರೆಫರಲ್ ಮಾಧ್ಯಮದ ಬಗ್ಗೆ",
        KycLangConstants.lblEnterSource: "ಮಾಧ್ಯಮ ನಮೂದಿಸಿ",
        KycLangConstants.lblReferralCode: "ರೆಫರಲ್ ಕೋಡ್",
        KycLangConstants.lblEnterCode: "ಕೋಡ್ ನಮೂದಿಸಿ",
      };
}
