import 'kyc_lang_constants.dart';

class KycTeIn {
  static Map<String, String> get translations => {
        KycLangConstants.headHighEarnings: 'అధిక ఆదాయం',
        KycLangConstants.msgHighEarnings:
            'మీ కష్టానికి ప్రతిఫలం లభిస్తుంది!\nమెరుగైన రివార్డులతో అపరిమిత ఆదాయ సంపాదనను ప్రారంభించండి',
        KycLangConstants.headOntimePayment: 'సకాలంలో పేఅవుట్లు',
        KycLangConstants.msgOntimePayment:
            'మమ్మల్ని నమ్మండి!\nమీ సంపాదనను ఎలాంటి ఆలస్యం లేకుండా సమయానికి పొందండి',
        KycLangConstants.headBirthdayLeave: 'పుట్టినరోజు పెయిడ్ లీవ్',
        KycLangConstants.msgBirthdayLeave:
            'మీ పుట్టినరోజు మా బాధ్యత!\nఎలాంటి చింత లేకుండా మీ ప్రత్యేక రోజును జరుపుకోండి',
        KycLangConstants.headWorkHours: 'అనువైన\nపని గంటలు',
        KycLangConstants.msgWorkHours:
            'మీకు నచ్చిన వేగంతో పని చేయండి!\nమీ షెడ్యూల్‌ను ఎంచుకునే స్వేచ్ఛను ఆస్వాదించండి',
        KycLangConstants.headDeliverExperience:
            'కలిసి డెలివరీ అనుభవాన్ని అందిద్దాం!!',
        KycLangConstants.msgGetStarted:
            '5000+ పైగా అధిక ఆదాయం పొందుతున్న కప్తాన్స్ (Kaptaans) కమ్యూనిటీలో చేరండి!',
        KycLangConstants.lblVerifyAccount: 'బ్యాంక్ ఖాతాను వెరిఫై చేయండి',
        KycLangConstants.msgVerifyAccount:
            'సకాలంలో పేఅవుట్ల కోసం దయచేసి మీ బ్యాంకు ఖాతా వివరాలను వెరిఫై చేయండి',
        KycLangConstants.msgBankAccountVerified:
            'మీ బ్యాంక్ ఖాతా వివరాలు విజయవంతంగా వెరిఫై చేయబడ్డాయి',
        KycLangConstants.lblCompleteYourKycWarning:
            'సంపాదన కొనసాగించడానికి దయచేసి త్వరలో మీ KYC వెరిఫికేషన్ పూర్తి చేయండి!',
        KycLangConstants.btnStartKyc: 'KYC ప్రారంభించండి',
        KycLangConstants.lblCompleteYourKyc: 'మీ KYC పూర్తి చేయండి',
        KycLangConstants.lblDocsRequired: 'అవసరమైన పత్రాలు',
        KycLangConstants.headSeamlessApp: 'సులభమైన యాప్',
        KycLangConstants.headFlexibleHours: 'అనువైన గంటలు',
        KycLangConstants.headHighIncentives: 'అధిక ఇన్సెంటివ్‌లు',
        KycLangConstants.headOntimeSupport: 'సమయానికి సపోర్ట్',
        KycLangConstants.lblCompleteJob: 'పని పూర్తి చేయండి',
        KycLangConstants.headUnderReview: 'KYC పరిశీలనలో ఉంది ⌛',
        KycLangConstants.headUnderReviewHello:
            'నమస్తే {name}, KYC పరిశీలనలో ఉంది ⌛',
        KycLangConstants.msgUnderReview:
            'మీ KYC ఇంకా పరిశీలనలో ఉంది. దయచేసి వేచి ఉండండి; పూర్తయిన తర్వాత మేము మీకు తెలియజేస్తాము',
        KycLangConstants.lblUnderReviewThanks:
            'మీ సహనానికి ధన్యవాదాలు, మీరు Blitzతో ఎందుకు పని చేయాలి?',
        KycLangConstants.lblApprovedKyc: 'మీ అప్లికేషన్ పంపబడింది',
        KycLangConstants.msgApprovedKyc:
            'అప్లికేషన్ అన్ని Blitz వేర్‌హౌస్‌లకు విజయవంతంగా పంపబడింది',
        KycLangConstants.lblUnderReview: 'పరిశీలనలో ఉంది',
        KycLangConstants.msgKycUnderReview:
            'మీ KYC వివరాలు పరిశీలనలో ఉన్నాయి, పూర్తి కావడానికి 24 గంటల వరకు సమయం పట్టవచ్చు',
        KycLangConstants.lblKycDetailsReviewed: 'KYC వివరాలు సమీక్షించబడ్డాయి',
        KycLangConstants.msgKycDetailsBeingReviewed:
            'మీ KYC వివరాలు సమీక్షించబడుతున్నాయి. దయచేసి కొన్ని నిమిషాలు వేచి ఉండండి',
        KycLangConstants.lblRefreshNow: 'ఇప్పుడే రిఫ్రెష్ చేయండి',
        KycLangConstants.lblRefreshInSeconds:
            '{seconds} సెకన్లలో రిఫ్రెష్ చేయండి',
        KycLangConstants.lblCompleteInDays: 'బ్యాంక్ వివరాలను పూర్తి చేయండి ',
        KycLangConstants.lblAlertHeadlineKyc:
            'గడువులోగా KYC పూర్తి చేయకపోతే, అకౌంట్ లాక్ చేయబడుతుంది',
        KycLangConstants.lblAlertHeadlineBank:
            'గడువులోగా బ్యాంక్ వివరాలు సమర్పించకపోతే, అకౌంట్ లాక్ చేయబడుతుంది',
        KycLangConstants.lblCompleteKyc:
            'సంపాదన కొనసాగించడానికి దయచేసి త్వరలో మీ KYC వెరిఫికేషన్ పూర్తి చేయండి!',
        KycLangConstants.msgErrorWrongKyc: 'అప్లికేషన్‌లో ఏదో తప్పు జరిగింది',
        KycLangConstants.msgDeadlineErrorKyc:
            'KYC గడువు అందుబాటులో లేదు. మిగిలిన రోజులను లెక్కించడం సాధ్యం కాదు.',
        KycLangConstants.lblKycRejected: 'మీ ప్రొఫైల్ తిరస్కరించబడింది',
        KycLangConstants.msgKycRejected:
            'KYC నిబంధనలను పాటించనందున మీ ప్రొఫైల్ తిరస్కరించబడింది',
        KycLangConstants.lblKycBlacklisted: 'మీరు బ్లాక్‌లిస్ట్ చేయబడ్డారు',
        KycLangConstants.msgKycBlacklisted:
            'మీ ప్రొఫైల్ బ్లాక్‌లిస్ట్ చేయబడింది, దయచేసి మీ టీమ్ లీడ్‌ను సంప్రదించండి',
        KycLangConstants.lblKycCompleted: 'KYC పూర్తయింది',
        KycLangConstants.msgKycCompleted:
            'మీ ప్రొఫైల్ KYC వివరాలు విజయవంతంగా వెరిఫై చేయబడ్డాయి',
        KycLangConstants.msgUnableToRefreshKycStatus:
            'KYC స్టేటస్ రిఫ్రెష్ చేయడం సాధ్యం కాలేదు',
        KycLangConstants.msgYoureAlmostDoneCollectOnboardingKitFromHub:
            "మీ పని దాదాపు పూర్తయింది—హబ్ నుండి మీ ఆన్‌బోర్డింగ్ కిట్ తీసుకోండి",
        KycLangConstants.headWorkDetailsCompleted: "పని వివరాలు పూర్తయ్యాయి",
        KycLangConstants.lblSelectAndNext: "ఎంచుకోండి & ముందుకు వెళ్లండి",
        KycLangConstants.lblSearchPincode: "పిన్‌కోడ్ సెర్చ్ చేయండి",
        KycLangConstants.lblSelectModeOfVehicle: "వాహనం రకాన్ని ఎంచుకోండి",
        KycLangConstants.msgDrivingLicenseRequired:
            "పెట్రోల్ వాహనాలకు డ్రైవింగ్ లైసెన్స్ అవసరం",
        KycLangConstants.lblPetrolMotorcycle: "పెట్రోల్ మోటార్ సైకిల్",
        KycLangConstants.lblEvVehicle: "EV వాహనం",
        KycLangConstants.lblThreeWheeler: "3 వీలర్",
        KycLangConstants.lblFourWheeler: "4 వీలర్",
        KycLangConstants.lblFuelBonus: "ఫ్యూయల్ బోనస్",
        KycLangConstants.lblNoFuelAmount: "ఫ్యూయల్ మొత్తం లేదు",
        KycLangConstants.msgYourProfileIsAllSetCompleteKycStartEarning:
            "మీ ప్రొఫైల్ అంతా సిద్ధంగా ఉంది!\nదయచేసి KYC పూర్తి చేసి సంపాదన ప్రారంభించండి",
        KycLangConstants.msgKeepTheFollowingDocumentsReadyForKyc:
            "KYC కోసం క్రింది పత్రాలను సిద్ధంగా ఉంచుకోండి",
        KycLangConstants.lblCompleteKycStartEarning:
            "KYC పూర్తి చేసి సంపాదన ప్రారంభించండి",
        KycLangConstants.lblDl: "డ్రైవింగ్ లైసెన్స్",
        KycLangConstants.lblPan: "పాన్ కార్డ్",
        KycLangConstants.lblAadhaar: "ఆధార్",
        KycLangConstants.lblSubmitBankDetailsToResumeJob:
            "పనిని తిరిగి ప్రారంభించడానికి బ్యాంక్ వివరాలను సమర్పించండి",
        KycLangConstants.msgPleaseCompleteAllYourDetailsSoonToContinueEarning:
            "సంపాదన కొనసాగించడానికి దయచేసి మీ వివరాలన్నింటినీ త్వరగా పూర్తి చేయండి!",
        KycLangConstants.btnShowQr: "QR చూపించు",
        KycLangConstants.btnCallHub: "హబ్‌కు కాల్ చేయండి",
        KycLangConstants.lblReachHubAndEarn:
            "ఈ రోజే హబ్‌ను సందర్శించి సంపాదన ప్రారంభించండి",
        KycLangConstants.btnShowHubDirection: "హబ్ దిశను చూపించు",
        KycLangConstants.lblWhatOurPartnersSay: "మా కప్తాన్స్ ఏమంటున్నారు ❤️",
        KycLangConstants.lblJoiningFeeDetails: "జాయినింగ్ ఫీజు వివరాలు",
        KycLangConstants.msgJoiningFeeWillBeDeductedFromYourFirstPayout:
            "జాయినింగ్ ఫీజు మీ మొదటి పేఅవుట్ నుండి \nతీసివేయబడుతుంది",
        KycLangConstants.headReview1:
            "నేను Blitz UPIలో అవకాశాన్ని చూశాను. ఇది వేగవంతమైనది, సులభమైనది మరియు ఇన్సెంటివ్‌లు నా ఆదాయంలో గణనీయమైన మార్పును తెచ్చాయి!",
        KycLangConstants.headReview2:
            "మైల్‌స్టోన్స్ ప్రతిరోజూ నన్ను మరింత కష్టపడటానికి ప్రేరేపిస్తాయి. నేను సాధించే మైల్‌స్టోన్స్ కష్టానికి తగిన ప్రతిఫలం ఉంటుందని చూపుతాయి.",
        KycLangConstants.headReview3:
            "ప్రతి డెలివరీ నన్ను నా లక్ష్యాలకు చేరువ చేస్తుంది.",
        KycLangConstants.headReview4:
            "Blitz ప్రతిరోజూ ముందుకు వెళ్లడానికి నాకు ప్రేరణనిస్తుంది.",
        KycLangConstants.headReview5:
            "నేను Blitz కుటుంబంలో భాగమైనందుకు గర్వపడుతున్నాను మరియు నా కష్టానికి గుర్తింపు లభించడం చూసి సంతోషిస్తున్నాను.",
        KycLangConstants.lblChandranNadarMumbaiHub:
            "— చంద్రన్ నాడార్, ముంబై హబ్",
        KycLangConstants.lblManishRaiDelhiHub: "— మనీష్ రాయ్, ఢిల్లీ హబ్",
        KycLangConstants.lblKrishnaGuptaMumbaiHub: "— కృష్ణ గుప్త, ముంబై హబ్",
        KycLangConstants.lblSharadPuneHub: "— శరద్, పుణె హబ్",
        KycLangConstants.lblShivnathHyderabadHub: "— శివనాథ్, హైదరాబాద్ హబ్",
        KycLangConstants.headCollectOnboardingKit:
            "ఆన్‌బోర్డింగ్ కిట్ తీసుకోండి,",
        KycLangConstants.headReferAndEarnThe: "రెఫర్ చేయండి మరియు సంపాదించండి",
        KycLangConstants.headCompleteMilestone: "మైల్‌స్టోన్ పూర్తి చేయండి",
        KycLangConstants.lblStartWorking: "పని ప్రారంభించండి",
        KycLangConstants.lblHighestBonus: "అత్యధిక బోనస్",
        KycLangConstants.lblEarnExtraEveryDay: "ప్రతిరోజూ అదనంగా సంపాదించండి",
        KycLangConstants.lblHighBonus: "హై బోనస్ 🔥",
        KycLangConstants.lblOtherHubs: "ఇతర హబ్‌లు",
        KycLangConstants.lblFriendsHub: "స్నేహితుని రెఫరల్ హబ్",
        KycLangConstants.headEarnUpto10000In1stMonth:
            "మొదటి నెలలో ₹10000 వరకు సంపాదించండి",
        KycLangConstants.lblThroughJoiningBonusAndIncentives:
            "జాయినింగ్ బోనస్ మరియు ఇన్సెంటివ్‌ల ద్వారా",
        KycLangConstants.headEarnUpto2500WithoutDelivering:
            "డెలివరీ చేయకుండానే ₹2500 వరకు సంపాదించండి",
        KycLangConstants.lblByReferringAFriendToJoinBlitz:
            "Blitzలో చేరడానికి మీ స్నేహితుడిని రెఫర్ చేయడం ద్వారా",
        KycLangConstants.msgPleaseSelectHubWhereYouWantToWorkInNextScreen:
            "తర్వాతి స్క్రీన్‌లో మీరు పని చేయాలనుకుంటున్న హబ్‌ను ఎంచుకోండి",
        KycLangConstants.headSelectHubInNextScreen:
            "తర్వాతి స్క్రీన్‌లో హబ్‌ను ఎంచుకోండి",
        KycLangConstants.lblWorkType: "పని రకం",
        KycLangConstants.lblEarnUpto: "సంపాదించండి",
        KycLangConstants.lblSimilarTo: "వీటిలాగే",
        KycLangConstants.lblSelectCity: "నగరాన్ని ఎంచుకోండి",
        KycLangConstants.lblShowQrManager: "ఈ QRని హబ్ మేనేజర్‌కు చూపించండి",
        KycLangConstants.msgQrCodeManager:
            "ఆన్‌బోర్డింగ్ పూర్తి చేయడానికి దయచేసి స్కాన్ కోసం ఈ QRని టీమ్ లీడ్‌కు చూపించండి",
        KycLangConstants.lblWaitingForDestination:
            "డెస్టినేషన్ కోసం వేచి చూస్తున్నాము...",
        KycLangConstants.lblServiceablePincodesDataNotAvailable:
            "సర్వీసబుల్ పిన్‌కోడ్ డేటా అందుబాటులో లేదు",
        KycLangConstants.lblFastLocalOrders: "ఫాస్ట్ లోకల్ ఆర్డర్లు ⚡",
        KycLangConstants.lblBulkOrders: "బల్క్ ఆర్డర్లు 📦",
        KycLangConstants.lblQuickCommerce: "క్విక్ కామర్స్",
        KycLangConstants.lblECommerce: "ఈ-కామర్స్",
        KycLangConstants.lblServiceablePincodes: "సర్వీసబుల్ పిన్‌కోడ్‌లు",
        KycLangConstants.msgNodeVerificationFailed:
            "నోడ్ వెరిఫికేషన్ విఫలమైంది",
        KycLangConstants.msgPleaseCompleteNodeVerificationFromFranchiseOwnerApp:
            "దయచేసి Franchise Owner యాప్ నుండి నోడ్ వెరిఫికేషన్ పూర్తి చేయండి",
        KycLangConstants.lblQrVerified: "QR వెరిఫై చేయబడింది",
        KycLangConstants.lblHowDidYouFirstHearAboutBlitz:
            "మీకు Blitz గురించి మొదటిసారి ఎలా తెలిసింది?",
        KycLangConstants.lblAboutReferralSource: "రెఫరల్ మూలం గురించి",
        KycLangConstants.lblEnterSource: "మూలాన్ని నమోదు చేయండి",
        KycLangConstants.lblReferralCode: "రెఫరల్ కోడ్",
        KycLangConstants.lblEnterCode: "కోడ్‌ను నమోదు చేయండి",
      };
}
