import 'kyc_lang_constants.dart';

class KycTaIn {
  static Map<String, String> get translations => {
        KycLangConstants.headHighEarnings: 'அதிக வருமானம்',
        KycLangConstants.msgHighEarnings:
            'உங்கள் உழைப்பிற்கு ஏற்ற பலன் கிடைக்கும்!\nசிறந்த வெகுமதிகளுடன் வரம்பற்ற வருமான வாய்ப்பைப் பெறுங்கள்',
        KycLangConstants.headOntimePayment: 'சரியான நேரத்திற்கு பேஅவுட்கள்',
        KycLangConstants.msgOntimePayment:
            'எங்களை நம்புங்கள்!\nஉங்கள் வருமானத்தை எந்த தாமதமும் இன்றி சரியான நேரத்தில் பெறுங்கள்',
        KycLangConstants.headBirthdayLeave:
            'பிறந்தநாள் சம்பளத்துடன் கூடிய விடுமுறை',
        KycLangConstants.msgBirthdayLeave:
            'உங்கள் பிறந்தநாள் கொண்டாட்டம் எங்களால்!\nஎந்தக் கவலையும் இன்றி உங்கள் சிறப்பு நாளைக் கொண்டாடுங்கள்',
        KycLangConstants.headWorkHours: 'நெகிழ்வான\nவேலை நேரம்',
        KycLangConstants.msgWorkHours:
            'உங்கள் விருப்பப்படி வேலை செய்யுங்கள்!\nஉங்கள் நேரத்தைத் தேர்ந்தெடுக்கும் சுதந்திரத்தை அனுபவியுங்கள்',
        KycLangConstants.headDeliverExperience:
            'இணைந்து ஒரு சிறந்த அனுபவத்தை வழங்குவோம்!!',
        KycLangConstants.msgGetStarted:
            '5000+ க்கும் மேற்பட்ட அதிக வருமானம் ஈட்டும் கப்தான்களின் (Kaptaans) சமூகத்தில் இணையுங்கள்!',
        KycLangConstants.lblVerifyAccount: 'வங்கி கணக்கைச் சரிபார்க்கவும்',
        KycLangConstants.msgVerifyAccount:
            'சரியான நேரத்தில் பேஅவுட்களைப் பெற உங்கள் வங்கி கணக்கு விவரங்களைச் சரிபார்க்கவும்',
        KycLangConstants.msgBankAccountVerified:
            'உங்கள் வங்கி கணக்கு விவரங்கள் வெற்றிகரமாகச் சரிபார்க்கப்பட்டன',
        KycLangConstants.lblCompleteYourKycWarning:
            'வருமானத்தைத் தொடர உங்கள் KYC சரிபார்ப்பை விரைவில் முடிக்கவும்!',
        KycLangConstants.btnStartKyc: 'KYC-ஐத் தொடங்கவும்',
        KycLangConstants.lblCompleteYourKyc: 'உங்கள் KYC-ஐ முடிக்கவும்',
        KycLangConstants.lblDocsRequired: 'தேவையான ஆவணங்கள்',
        KycLangConstants.headSeamlessApp: 'எளிதான ஆப்',
        KycLangConstants.headFlexibleHours: 'நெகிழ்வான நேரம்',
        KycLangConstants.headHighIncentives: 'அதிக இன்சென்டிவ்கள்',
        KycLangConstants.headOntimeSupport: 'சரியான நேரத்திற்கு உதவி',
        KycLangConstants.lblCompleteJob: 'வேலையை முடிக்கவும்',
        KycLangConstants.headUnderReview: 'KYC பரிசீலனையில் உள்ளது ⌛',
        KycLangConstants.headUnderReviewHello:
            'வணக்கம் {name}, KYC பரிசீலனையில் உள்ளது ⌛',
        KycLangConstants.msgUnderReview:
            'உங்கள் KYC இன்னும் பரிசீலனையில் உள்ளது. தயவுசெய்து காத்திருக்கவும்; முடிந்ததும் உங்களுக்குத் தெரிவிப்போம்',
        KycLangConstants.lblUnderReviewThanks:
            'உங்கள் பொறுமைக்கு நன்றி, நீங்கள் ஏன் Blitz உடன் வேலை செய்ய வேண்டும்?',
        KycLangConstants.lblApprovedKyc: 'உங்கள் விண்ணப்பம் அனுப்பப்பட்டது',
        KycLangConstants.msgApprovedKyc:
            'விண்ணப்பம் அனைத்து Blitz கிடங்குகளுக்கும் வெற்றிகரமாக அனுப்பப்பட்டது',
        KycLangConstants.lblUnderReview: 'பரிசீலனையில் உள்ளது',
        KycLangConstants.msgKycUnderReview:
            'உங்கள் KYC விவரங்கள் பரிசீலனையில் உள்ளன, முடிக்க 24 மணிநேரம் வரை ஆகலாம்',
        KycLangConstants.lblKycDetailsReviewed:
            'KYC விவரங்கள் சரிபார்க்கப்பட்டன',
        KycLangConstants.msgKycDetailsBeingReviewed:
            'உங்கள் KYC விவரங்கள் சரிபார்க்கப்படுகின்றன. தயவுசெய்து சில நிமிடங்கள் காத்திருக்கவும்',
        KycLangConstants.lblRefreshNow: 'இப்போதே புதுப்பிக்கவும்',
        KycLangConstants.lblRefreshInSeconds:
            '{seconds} வினாடிகளில் புதுப்பிக்கவும்',
        KycLangConstants.lblCompleteInDays: 'வங்கி விவரங்களை முடிக்கவும் ',
        KycLangConstants.lblAlertHeadlineKyc:
            'குறிப்பிட்ட காலத்திற்குள் KYC முடிக்கப்படாவிட்டால், அக்கவுண்ட் லாக் செய்யப்படும்',
        KycLangConstants.lblAlertHeadlineBank:
            'குறிப்பிட்ட காலத்திற்குள் வங்கி விவரங்கள் சமர்ப்பிக்கப்படாவிட்டால், அக்கவுண்ட் லாக் செய்யப்படும்',
        KycLangConstants.lblCompleteKyc:
            'வருமானத்தைத் தொடர உங்கள் KYC சரிபார்ப்பை விரைவில் முடிக்கவும்!',
        KycLangConstants.msgErrorWrongKyc: 'ஆப்பில் ஏதோ தவறு நடந்துள்ளது',
        KycLangConstants.msgDeadlineErrorKyc:
            'KYC காலக்கெடு கிடைக்கவில்லை. மீதமுள்ள நாட்களைக் கணக்கிட முடியாது.',
        KycLangConstants.lblKycRejected: 'உங்கள் புரோஃபைல் நிராகரிக்கப்பட்டது',
        KycLangConstants.msgKycRejected:
            'KYC விதிமுறைகளைப் பின்பற்றாததால் உங்கள் புரோஃபைல் நிராகரிக்கப்பட்டது',
        KycLangConstants.lblKycBlacklisted:
            'நீங்கள் பிளாக்லிஸ்ட் செய்யப்பட்டுள்ளீர்கள்',
        KycLangConstants.msgKycBlacklisted:
            'உங்கள் புரோஃபைல் பிளாக்லிஸ்ட் செய்யப்பட்டுள்ளது, உங்கள் டீம் லீடைத் தொடர்பு கொள்ளவும்',
        KycLangConstants.lblKycCompleted: 'KYC முடிந்தது',
        KycLangConstants.msgKycCompleted:
            'உங்கள் புரோஃபைலின் KYC விவரங்கள் வெற்றிகரமாகச் சரிபார்க்கப்பட்டன',
        KycLangConstants.msgUnableToRefreshKycStatus:
            'KYC நிலையைப் புதுப்பிக்க முடியவில்லை',
        KycLangConstants.msgYoureAlmostDoneCollectOnboardingKitFromHub:
            "உங்கள் வேலை கிட்டத்தட்ட முடிந்துவிட்டது—ஹப்பில் இருந்து உங்கள் ஆன்போர்டிங் கிட்டைப் பெற்றுக்கொள்ளுங்கள்",
        KycLangConstants.headWorkDetailsCompleted:
            "வேலை விவரங்கள் முடிக்கப்பட்டன",
        KycLangConstants.lblSelectAndNext: "தேர்வு செய்து தொடரவும்",
        KycLangConstants.lblSearchPincode: "பின்கோடைத் தேடவும்",
        KycLangConstants.lblSelectModeOfVehicle:
            "வாகன வகையைத் தேர்வு செய்யவும்",
        KycLangConstants.msgDrivingLicenseRequired:
            "பெட்ரோல் வாகனங்களுக்கு ஓட்டுநர் உரிமம் அவசியம்",
        KycLangConstants.lblPetrolMotorcycle: "பெட்ரோல் மோட்டார் சைக்கிள்",
        KycLangConstants.lblEvVehicle: "EV வாகனம்",
        KycLangConstants.lblThreeWheeler: "3 சக்கர வாகனம்",
        KycLangConstants.lblFourWheeler: "4 சக்கர வாகனம்",
        KycLangConstants.lblFuelBonus: "ஃபியூயல் போனஸ்",
        KycLangConstants.lblNoFuelAmount: "ஃபியூயல் தொகை இல்லை",
        KycLangConstants.msgYourProfileIsAllSetCompleteKycStartEarning:
            "உங்கள் புரோஃபைல் தயாராக உள்ளது!\nKYC-ஐ முடித்து வருமானத்தைத் தொடங்குங்கள்",
        KycLangConstants.msgKeepTheFollowingDocumentsReadyForKyc:
            "KYC-க்கு பின்வரும் ஆவணங்களைத் தயார் நிலையில் வைத்திருக்கவும்",
        KycLangConstants.lblCompleteKycStartEarning:
            "KYC-ஐ முடித்து வருமானத்தைத் தொடங்குங்கள்",
        KycLangConstants.lblDl: "ஓட்டுநர் உரிமம்",
        KycLangConstants.lblPan: "பான் கார்டு",
        KycLangConstants.lblAadhaar: "ஆதார்",
        KycLangConstants.lblSubmitBankDetailsToResumeJob:
            "வேலையைத் தொடர வங்கி விவரங்களைச் சமர்ப்பிக்கவும்",
        KycLangConstants.msgPleaseCompleteAllYourDetailsSoonToContinueEarning:
            "வருமானத்தைத் தொடர உங்கள் அனைத்து விவரங்களையும் விரைவில் முடிக்கவும்!",
        KycLangConstants.btnShowQr: "QR-ஐக் காட்டவும்",
        KycLangConstants.btnCallHub: "ஹப்பிற்கு அழைக்கவும்",
        KycLangConstants.lblReachHubAndEarn:
            "இன்றே ஹப்பிற்குச் சென்று வருமானத்தைத் தொடங்குங்கள்",
        KycLangConstants.btnShowHubDirection: "ஹப் திசையைக் காட்டவும்",
        KycLangConstants.lblWhatOurPartnersSay:
            "எங்கள் கப்தான்கள் என்ன சொல்கிறார்கள் ❤️",
        KycLangConstants.lblJoiningFeeDetails: "இணைப்புக் கட்டண விவரங்கள்",
        KycLangConstants.msgJoiningFeeWillBeDeductedFromYourFirstPayout:
            "இணைப்புக் கட்டணம் உங்கள் முதல் பேஅவுட்டில் இருந்து \nகழிக்கப்படும்",
        KycLangConstants.headReview1:
            "நான் Blitz UPI-இல் ஒரு வாய்ப்பைக் கண்டேன். இது வேகமானது, எளிதானது மற்றும் இன்சென்டிவ்கள் என் வருமானத்தில் மாற்றத்தை ஏற்படுத்தியுள்ளன!",
        KycLangConstants.headReview2:
            "மைல்கற்கள் என்னை ஒவ்வொரு நாளும் கடினமாக உழைக்கத் தூண்டுகின்றன. உழைப்பிற்கு ஏற்ற பலன் கிடைக்கும் என்பதை இது காட்டுகிறது.",
        KycLangConstants.headReview3:
            "ஒவ்வொரு டெலிவரியும் என்னை என் இலக்குகளுக்கு நெருக்கமாக்குகிறது.",
        KycLangConstants.headReview4:
            "ஒவ்வொரு நாளும் முன்னேற Blitz எனக்கு ஊக்கமளிக்கிறது.",
        KycLangConstants.headReview5:
            "நான் Blitz குடும்பத்தின் ஒரு பகுதியாக இருப்பதில் பெருமை கொள்கிறேன், என் உழைப்பிற்கு அங்கீகாரம் கிடைப்பது மகிழ்ச்சி அளிக்கிறது.",
        KycLangConstants.lblChandranNadarMumbaiHub:
            "— சந்திரன் நாடார், மும்பை ஹப்",
        KycLangConstants.lblManishRaiDelhiHub: "— மனிஷ் ராய், டெல்லி ஹப்",
        KycLangConstants.lblKrishnaGuptaMumbaiHub:
            "— கிருஷ்ணா குப்தா, மும்பை ஹப்",
        KycLangConstants.lblSharadPuneHub: "— ஷரத், புனே ஹப்",
        KycLangConstants.lblShivnathHyderabadHub: "— சிவநாத், ஹைதராபாத் ஹப்",
        KycLangConstants.headCollectOnboardingKit:
            "ஆன்போர்டிங் கிட்டைப் பெறவும்,",
        KycLangConstants.headReferAndEarnThe: "ரெஃபர் செய்து சம்பாதிக்கவும்",
        KycLangConstants.headCompleteMilestone: "மைல்கல்லை முடிக்கவும்",
        KycLangConstants.lblStartWorking: "வேலையைத் தொடங்குங்கள்",
        KycLangConstants.lblHighestBonus: "அதிகபட்ச போனஸ்",
        KycLangConstants.lblEarnExtraEveryDay:
            "ஒவ்வொரு நாளும் கூடுதல் வருமானம் பெறுங்கள்",
        KycLangConstants.lblHighBonus: "ஹை போனஸ் 🔥",
        KycLangConstants.lblOtherHubs: "மற்ற ஹப்கள்",
        KycLangConstants.lblFriendsHub: "நண்பரின் ரெஃபரல் ஹப்",
        KycLangConstants.headEarnUpto10000In1stMonth:
            "முதல் மாதத்தில் ₹10000 வரை சம்பாதிக்கவும்",
        KycLangConstants.lblThroughJoiningBonusAndIncentives:
            "இணைப்பு போனஸ் மற்றும் இன்சென்டிவ்கள் மூலம்",
        KycLangConstants.headEarnUpto2500WithoutDelivering:
            "டெலிவரி செய்யாமலேயே ₹2500 வரை சம்பாதிக்கவும்",
        KycLangConstants.lblByReferringAFriendToJoinBlitz:
            "நண்பரை Blitz-இல் இணைய ரெஃபர் செய்வதன் மூலம்",
        KycLangConstants.msgPleaseSelectHubWhereYouWantToWorkInNextScreen:
            "அடுத்த ஸ்கிரீனில் நீங்கள் வேலை செய்ய விரும்பும் ஹப்பைத் தேர்வு செய்யவும்",
        KycLangConstants.headSelectHubInNextScreen:
            "அடுத்த ஸ்கிரீனில் ஹப்பைத் தேர்வு செய்யவும்",
        KycLangConstants.lblWorkType: "வேலை வகை",
        KycLangConstants.lblEarnUpto: "சம்பாதிக்கவும்",
        KycLangConstants.lblSimilarTo: "இதைப் போலவே",
        KycLangConstants.lblSelectCity: "நகரத்தைத் தேர்வு செய்யவும்",
        KycLangConstants.lblShowQrManager: "இந்த QR-ஐ ஹப் மேலாளரிடம் காட்டவும்",
        KycLangConstants.msgQrCodeManager:
            "ஆன்போர்டிங்கை முடிக்க ஸ்கேன் செய்ய இந்த QR-ஐ டீம் லீடிடம் காட்டவும்",
        KycLangConstants.lblWaitingForDestination:
            "இடத்திற்காகக் காத்திருக்கிறது...",
        KycLangConstants.lblServiceablePincodesDataNotAvailable:
            "பின்கோடு விவரங்கள் கிடைக்கவில்லை",
        KycLangConstants.lblFastLocalOrders: "வேகமான உள்ளூர் ஆர்டர்கள் ⚡",
        KycLangConstants.lblBulkOrders: "மொத்த ஆர்டர்கள் 📦",
        KycLangConstants.lblQuickCommerce: "குவிக் காமர்ஸ்",
        KycLangConstants.lblECommerce: "இ-காமர்ஸ்",
        KycLangConstants.lblServiceablePincodes: "சேவைக்குரிய பின்கோடுகள்",
        KycLangConstants.msgNodeVerificationFailed:
            "நோட் சரிபார்ப்பு தோல்வியடைந்தது",
        KycLangConstants.msgPleaseCompleteNodeVerificationFromFranchiseOwnerApp:
            "தயவுசெய்து Franchise Owner ஆப்பிலிருந்து நோட் சரிபார்ப்பை முடிக்கவும்",
        KycLangConstants.lblQrVerified: "QR சரிபார்க்கப்பட்டது",
        KycLangConstants.lblHowDidYouFirstHearAboutBlitz:
            "உங்களுக்கு Blitz பற்றி முதலில் எப்படித் தெரிந்தது?",
        KycLangConstants.lblAboutReferralSource: "ரெஃபரல் ஆதாரம் பற்றி",
        KycLangConstants.lblEnterSource: "ஆதாரத்தை உள்ளிடவும்",
        KycLangConstants.lblReferralCode: "ரெஃபரல் கோடு",
        KycLangConstants.lblEnterCode: "கோடை உள்ளிடவும்",
      };
}
